programmingTutorial08/programmingTutorial08/testCase/003-heatSimpleFoam/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(	
    (0 0 -0.05)
    (0.5 0 -0.05)
    (1 0 -0.05)
    (0 1 -0.05)
    (0.5 1 -0.05)
    (1 1 -0.05)
    (0 3 -0.05)
    (0.5 3 -0.05)
    (3 3 -0.05)   
    (0 4 -0.05)   
    (0.5 4 -0.05)  
    (3 4 -0.05)
    (0 0 0.05)
    (0.5 0 0.05)
    (1 0 0.05)
    (0 1 0.05)
    (0.5 1 0.05)
    (1 1 0.05)
    (0 3 0.05)
    (0.5 3 0.05)
    (3 3 0.05)   
    (0 4 0.05)   
    (0.5 4 0.05)  
    (3 4 0.05)
    
);

blocks
(
    hex (0 1 4 3 12 13 16 15) (10 20 1) simpleGrading (1 1 1)
    hex (1 2 5 4 13 14 17 16) (10 20 1) simpleGrading (1 1 1)
    hex (3 4 7 6 15 16 19 18) (10 40 1) simpleGrading (1 1 1)
    hex (6 7 10 9 18 19 22 21) (10 20 1) simpleGrading (1 1 1)
    hex (7 8 11 10 19 20 23 22) (60 20 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 1 13 12)
            (1 2 14 13)
        );
    }
outlet
    {
        type patch;
        faces
        (
            (8 11 23 20)
        );
    }
    Right
    {
        type symmetryPlane;
        faces
        (
            (0 12 15 3)
            (3 15 18 6)
            (6 18 21 9)
        );
    }
    wall
    {
        type patch;
        faces
        (
            (2 5 17 14)
            (5 4 16 17)
            (7 19 16 4)
            (10 22 23 11)
            (7 8 20 19)
            (10 9 21 22)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 4 1)
            (4 5 2 1)
            (4 3 6 7)
            (7 6 9 10)
            (10 11 8 7)
            (12 13 16 15)
            (16 13 14 17)
            (15 16 19 18)
            (21 18 19 22)
            (22 19 20 23)
         );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
