programmingTutorial08/programmingTutorial08/testCase/003-heatSimpleFoam/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          20;
        startFace       4240;
    }
    outlet
    {
        type            patch;
        nFaces          20;
        startFace       4260;
    }
    Right
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          80;
        startFace       4280;
    }
    wall
    {
        type            patch;
        nFaces          200;
        startFace       4360;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          4400;
        startFace       4560;
    }
)

// ************************************************************************* //
